workflows/MultiCityConnectingFlights/AirPriceReq.xml

	<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
					<soapenv:Header/>
					<soapenv:Body>
						<air:AirPriceReq xmlns:air="http://www.travelport.com/schema/air_v42_0" AuthorizedBy="user" TargetBranch="P7090934" TraceId="trace">
							<com:BillingPointOfSaleInfo xmlns:com="http://www.travelport.com/schema/common_v42_0" OriginApplication="UAPI"/>
								<air:AirItinerary><air:AirSegment Key="LP2eKC8Q2BKAeArDAAAAAA==" Group="0" Carrier="PK" FlightNumber="308" Origin="KHI" Destination="ISB" DepartureTime="2020-03-19T16:00:00.000+05:00" ArrivalTime="2020-03-19T17:55:00.000+05:00" FlightTime="115" Distance="689" ETicketability="Yes" Equipment="32A" ChangeOfPlane="false" ParticipantLevel="Secure Sell" LinkAvailability="true" PolledAvailabilityOption="No polled avail exists" OptionalServicesIndicator="false" AvailabilitySource="A" AvailabilityDisplayType="Fare Shop/Optimal Shop" ProviderCode="1G"/><air:AirSegment Key="LP2eKC8Q2BKAgArDAAAAAA==" Group="0" Carrier="PK" FlightNumber="653" Origin="ISB" Destination="LHE" DepartureTime="2020-03-19T20:00:00.000+05:00" ArrivalTime="2020-03-19T21:00:00.000+05:00" FlightTime="60" Distance="167" ETicketability="Yes" Equipment="ATR" ChangeOfPlane="false" ParticipantLevel="Secure Sell" LinkAvailability="true" PolledAvailabilityOption="No polled avail exists" OptionalServicesIndicator="false" AvailabilitySource="A" AvailabilityDisplayType="Fare Shop/Optimal Shop" ProviderCode="1G"/><air:AirSegment Key="LP2eKC8Q2BKAiArDAAAAAA==" Group="1" Carrier="PK" FlightNumber="1852" Origin="LHE" Destination="ISB" DepartureTime="2020-04-09T20:15:00.000+05:00" ArrivalTime="2020-04-09T21:05:00.000+05:00" FlightTime="50" Distance="167" ETicketability="Yes" Equipment="772" ChangeOfPlane="false" ParticipantLevel="Secure Sell" LinkAvailability="true" PolledAvailabilityOption="No polled avail exists" OptionalServicesIndicator="false" AvailabilitySource="A" AvailabilityDisplayType="Fare Shop/Optimal Shop" ProviderCode="1G"/><air:AirSegment Key="LP2eKC8Q2BKAkArDAAAAAA==" Group="2" Carrier="PK" FlightNumber="785" Origin="ISB" Destination="LHR" DepartureTime="2020-05-14T11:35:00.000+05:00" ArrivalTime="2020-05-14T15:05:00.000+01:00" FlightTime="450" Distance="3741" ETicketability="Yes" Equipment="772" ChangeOfPlane="false" ParticipantLevel="Secure Sell" LinkAvailability="true" PolledAvailabilityOption="No polled avail exists" OptionalServicesIndicator="false" AvailabilitySource="A" AvailabilityDisplayType="Fare Shop/Optimal Shop" ProviderCode="1G"/></air:AirItinerary><com:SearchPassenger xmlns:com="http://www.travelport.com/schema/common_v42_0" BookingTravelerRef="3" Code="ADT" /><com:SearchPassenger xmlns:com="http://www.travelport.com/schema/common_v42_0" BookingTravelerRef="1" Code="CNN" Age="11" DOB="2009-02-28" /><com:SearchPassenger xmlns:com="http://www.travelport.com/schema/common_v42_0" BookingTravelerRef="2" Code="INF" Age="1" DOB="2019-02-28" />
							<air:AirPricingCommand CabinClass="Economy"/>
						</air:AirPriceReq>
					</soapenv:Body>
				</soapenv:Envelope>